app/controllers/pages_controller.rb

  def profile
    #grab username from URL
   if (User.find_by_username(params[:id]))
    @username = params[:id]
  else
    #404 redirect
    redirect_to root_path, :notice=> 'User not found!'
   end

   @tofollow = User.all
   @posts = Post.all.where('user_id = ?', User.find_by_username(params[:id]).id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "test1"]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 4)  ORDER BY "posts"."created_at" DESC